Revit 2027 API
BuiltInFailures.MatchlineFailures Class
 Failures about Matchline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.MatchlineFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MatchlineFailures
Public NotInheritable Class MatchlineFailures
public ref class MatchlineFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MatchlineFailures = class end
The BuiltInFailures.MatchlineFailures type exposes the following members.
Properties
Name | Description
CreationFailed |  Matchline top extent should be higher than its bottom.
Top
See Also
Reference
Autodesk.Revit.DB Namespace